package com.example.testController.singleResponsibility;



//single responsibility- ის ცხოვრებისეულ მაგალითად შეგვიძლია მოვიყვანოთ ერთი სამუშაო რვეული სადაც ორი ადამიანი
// აკეთებს ჩანაწერს და ცვლის მას, პირველი როდესაც ჩანაწერს გააკეთებს შესაბამისად შეიცვლება მეორე ადამიანის მიერ შეყვანილი
// ჩანაწერიც და ა.შ,შესაბამისად მათ დამოუკიდებელი სამუშაო რვეული უნდა გააჩნდეთ, რათა დამოუკიდებლად გააკეთონ საკუთარი ჩანაწერები.
public class squareAreaCalculator {

    int area=0;

    public int area(int num){
        area=num*num;
        return area;
    }


    //  ეს იქნებოდა single responsibility პრინციპის დარღვევის მაგალითი
    // რომ გამოვასწოროთ ეს შემთხვევა, უნდა შევქმნათ ცალკე კლასი
    // printArea -თვის სადაც დაპრინტვის ლოგიკას ცალკე გავიტანთ რადგან
    // გამოთვლისა და დაპრინტვის ლოგიკა განსხვავდება ერთმანეთისგან, შესაბამისად,
    // შეგვეძლება ცალცალკე მოდიფიკაცია ამ კლასების ისე, რომ ერთმანეთზე არ იყვნენ დამოკიდებულები.

    public void printArea(int num){

        System.out.println(area(num));
    }


}
